
Процедура ПередНачаломРаботыСистемы() Экспорт 	
    ОбработкаОтправкиСообщения = Новый ОписаниеОповещения("ОбработкаОтправкиСообщения", ЭтотОбъект);
    СистемаВзаимодействия.ПодключитьОбработчикПослеОтправкиСообщения(ОбработкаОтправкиСообщения);  			
КонецПроцедуры  

Асинх Функция ПолучитьВложенияСообщения(Сообщение) 
	
	Вложения  = Сообщение.Вложения;
	Результат = Новый Массив;
	
	Если Вложения.Количество() = 0 Тогда	
		Возврат Результат;
	КонецЕсли;	 
		
	Для каждого СтрокаВложения Из Вложения Цикл				
		
		Поток  					= Ждать СтрокаВложения.ОткрытьПотокДляЧтенияАсинх(); 		
		Чтение 					= Новый ЧтениеДанных(Поток);                         		
		ДвоичныеДанныеВложения 	= Чтение.Прочитать().ПолучитьДвоичныеДанные(); 
		
		ДвоичныеДанные          = Новый Соответствие;
		ДвоичныеДанные.Вставить(СтрокаВложения.Наименование, ДвоичныеДанныеВложения); 			
		
		Результат.Добавить(ДвоичныеДанные);
		
	КонецЦикла;
	
	Возврат Результат;
    	
КонецФункции 

Функция ПолучитьКлючОбсуждения(Сообщение, Обсуждение) 
	
	Результат = Обсуждение.Ключ;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;    
	
	Результат  = Новый Массив;
	Получатели = Сообщение.Получатели;
	
	Для каждого СтокаПолучатели Из Получатели Цикл		
		Получатель = Строка(СтокаПолучатели);
		Результат.Добавить(Получатель);		
	КонецЦикла;
	
	Возврат Результат;	
    	
КонецФункции 

Асинх Процедура ОбработкаОтправкиСообщения(Сообщение, Обсуждение, ДополнительныеПараметры) Экспорт				
	
	КлючОбсуждения    = ПолучитьКлючОбсуждения(Сообщение, Обсуждение); 
	Текст             = Строка(Сообщение.Текст);
	ВложенияСообщений = Ждать ПолучитьВложенияСообщения(Сообщение);
	
	ГринАПИ_СистемаВзаимодейтвия.ОбработкаОтправкиСообщения(КлючОбсуждения, Текст, ВложенияСообщений);     	
	
КонецПроцедуры  



