
&НаКлиенте
Процедура НачатьБеседу(Команда)   
	
	Если Не ПроверитьЗаполнение() Тогда		
		Возврат;	
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Для созданием беседы справочник должен быть записан.");
	КонецЕсли; 	
	
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		ПоказатьПредупреждение(, "Информационная база не зарегистрирована.");
	КонецЕсли; 
		
	ТекстПредупреждения = НачатьБеседуНаСервере(); 
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры                                         

&НаСервере
Функция НачатьБеседуНаСервере() 	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользовательИдентификатор = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();                                           
	
	Наименование         = Объект.Наименование;
	НомерТелефона        = Объект.НомерТелефона;
	КонтактИдентификатор = ГринАПИ_Служебный.ПолучитьПользователяСистемыВзаимодействия(Наименование, НомерТелефона);
	
	КлючОбсуждения       = СтрШаблон("%1 - %2", ТекущийПользовательИдентификатор, КонтактИдентификатор);	
	Обсуждение           = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсуждения);
	Результат            = "Беседа успешно обновлена.";
	
	Если Обсуждение = Неопределено Тогда					
		
		Обсуждение           = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Групповое = Ложь;
		Обсуждение.Ключ      = КлючОбсуждения;
		
		Обсуждение.Участники.Добавить(ТекущийПользовательИдентификатор);
		Обсуждение.Участники.Добавить(КонтактИдентификатор);
		
		Обсуждение.Записать();		
		
		Результат = "Беседа успешно создана.";
		
	КонецЕсли;  	
	
	Объект.КлючОбсуждения       = КлючОбсуждения;
	Объект.КонтактИдентификатор = КонтактИдентификатор;
	
	РегистрыСведений.ГринАПИ_ПараметрыПодключения.ДобавитьЗаписьВРегистрСведений(Объект.Ссылка, КлючОбсуждения, 
		КонтактИдентификатор);
	
	Возврат Результат;	
	
КонецФункции
