
&НаКлиенте
Процедура ЗагрузитьКонтактыИзWhatsApp(Команда)		
	ОткрытьФорму("Справочник.ГринАПИ_Контакты.Форма.ФормаПодбораКонтактов", , ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	Если Не ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда	
		Возврат;
	КонецЕсли;

	ИмяВыбраннойФормы = ВыбранноеЗначение.ИмяФормы;
	
	Если ИмяВыбраннойФормы = ГринАПИ_СлужебныйКлиент.ПолучитьИмяФормыПодбораКонтактов() Тогда		
		ЗагрузитьКонтактыИзWhatsAppСервер(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтактыИзWhatsAppСервер(ВыбранноеЗначение)

	Если Не ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда	
		Возврат;
	КонецЕсли;
	
	КонтактыТаблицаЗначения = Справочники.ГринАПИ_Контакты.ПолучитьКонтактыТаблицаЗначения();
	КонтактыМассив          = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.Адрес);
	
	Для Каждого СтрокаКонтактыМассив Из КонтактыМассив Цикл 
		
		Отбор = Новый Структура("Наименование, НомерТелефона");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаКонтактыМассив);
		
		КонтактыСтроки = КонтактыТаблицаЗначения.НайтиСтроки(Отбор);
		
		Если Не КонтактыСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;		
				
		НоваяСтрока = Справочники.ГринАПИ_Контакты.СоздатьЭлемент();				
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКонтактыМассив);
		
		НоваяСтрока.Записать();				
		
	КонецЦикла;	
	
	Элементы.Список.Обновить();

КонецПроцедуры 






