
Процедура УдалитьВсеЗаписи() Экспорт  		
	НаборЗаписей = РегистрыСведений.ГринАПИ_ПараметрыПодключения.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();	 
КонецПроцедуры     

Процедура ДобавитьЗаписьВРегистрСведений(Контакт, КлючОбсуждения = Неопределено, 
	КонтактИдентификатор = Неопределено) Экспорт
	    
    МенеджерЗаписи = РегистрыСведений.ГринАПИ_ПараметрыПодключения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Контакт              = Контакт;
	МенеджерЗаписи.ПользовательWhatsApp = Контакт.ПользовательWhatsApp;
	
	Если Не КлючОбсуждения = Неопределено Тогда
		МенеджерЗаписи.КлючОбсуждения = КлючОбсуждения;	
	КонецЕсли;
	
	Если Не КонтактИдентификатор = Неопределено Тогда
		МенеджерЗаписи.КонтактИдентификатор = КонтактИдентификатор;	
	КонецЕсли;	
	
	МенеджерЗаписи.Записать();    
	
КонецПроцедуры    

Функция ПолучитьДанныеКонтакта(КлючОбсуждения) Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка
	|ГДЕ
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения = &КлючОбсуждения";
	
	Запрос.УстановитьПараметр("КлючОбсуждения", КлючОбсуждения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	НомераТелефонов        = Новый Массив;
	РезультатСтруктура     = Новый Структура("Контакт, НомерТелефона, idInstance, ApiToken, КлючОбсуждения");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыборкаДетальныеЗаписи);
		НомераТелефонов.Добавить(ВыборкаДетальныеЗаписи.НомерТелефона);
	КонецЦикла;    
	
	РезультатСтруктура.Вставить("НомераТелефонов", НомераТелефонов);
	
	Возврат РезультатСтруктура;
	
КонецФункции  

Функция ПолучитьДанныеКонтактаИзМассива(КлючОбсуждения) Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка
	|ГДЕ
	|	ГринАПИ_ПараметрыПодключения.КонтактИдентификатор В(&КлючОбсуждения)";
	
	Запрос.УстановитьПараметр("КлючОбсуждения", КлючОбсуждения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	НомераТелефонов        = Новый Массив;
	РезультатСтруктура     = Новый Структура("Контакт, НомерТелефона, idInstance, ApiToken, КлючОбсуждения");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыборкаДетальныеЗаписи);		
		НомераТелефонов.Добавить(ВыборкаДетальныеЗаписи.НомерТелефона);
	КонецЦикла;
	
	РезультатСтруктура.Вставить("НомераТелефонов", НомераТелефонов);
	
	Возврат РезультатСтруктура;
	
КонецФункции  

Функция ПолучитьДанныеКонтактов() Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить();	
	
	Возврат Результат;	
	
КонецФункции  