////////////////////////////////////////////////////////////////////////////////
// Подсистема "GreenAPI".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьСсылку(ВебСсылка) Экспорт
	Оповещение = Новый ОписаниеОповещения("ЗавершитьЗапускПриложенияGR", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ВебСсылка);
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьЗапускПриложенияGR(КодВозврата, ДополнительныеПараметры) Экспорт	
	// Действия не требуются	
КонецПроцедуры

Функция ПолучитьИмяФормыПодбораКонтактов() Экспорт
	Возврат "ФормаПодбораКонтактов";
КонецФункции 


#КонецОбласти
